[
    {
        "id": "0",
        "title": "Booki",
        "cover": "/src/assets/booki.png",
        "link": "https://quentin1522.github.io/Projet-3-booki/",
        "description": "Créer la page d'accueil d'une agence de voyage en utilisant HTML et CSS.\nCe projet a pour but d'intégrer l'interface responsive du site.\nJ'avais à disposition une maquette figma avec toutes les tailles d'écrans (mobile, tablette, desktop).\nIl a également été demandé d'avoir aucune erreur dans le validateur de code W3C."
      },      
    {
        "id": "1",
        "title": "Oh My Food",
        "cover": "/src/assets/ohmyfood.png",
        "link": "https://quentin1522.github.io/Projet-4-OhMyFood/",
            "description": "Ce projet a pour but de travailler sur l'interface mobile-first du site d'une start-up.\nOn utilise le préprocesseur Sass, nous devons aussi implémenter des animations CSS.\nNous devons intégrer une maquette en mobile-first. On dispose de la maquette Figma avec toutes les tailles d'écrans (mobile, tablette, desktop)."
          },          
    {
        "id": "2",
        "title": "Print-It",
        "cover": "/src/assets/printit.png",
        "link": "https://quentin1522.github.io/Projet-5-Print-it/",
        "description": "Ce projet consiste à dynamiser le site statique d'une imprimerie en y ajoutant un carrousel interactif en JavaScript. Il permet de découvrir les bases du langage JavaScript et d'apprendre à intégrer des fonctionnalités dynamiques pour améliorer l'expérience utilisateur. L'objectif est d'ajouter un carrousel via JavaScript tout en modifiant le code HTML et CSS existant. Visual Studio Code sera utilisé pour le développement, et GitHub pour la gestion des versions. Ce projet offre une introduction à la programmation web avec JavaScript."
    },
    {
        "id": "3",
        "title": "Sophie Bluel",
        "cover": "/src/assets/sophieBluel.png",
        "link": "https://github.com/Quentin1522/Projet-6-Sophie-Bluel",
        "pictures":[
            "/src/assets/sophieBluel.png",
            "/src/assets/sophieBluel2.png",
            "/src/assets/sophieBluel3.png",
            "/src/assets/sophieBluel4.png"
        ],
            "description": "Ce projet consiste à créer une page web dynamique pour le site d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API. Vous développerez la page de présentation des travaux à partir du HTML fourni, gérant les événements utilisateurs et manipulant le DOM avec JavaScript. Vous créerez également une page de connexion et une modale pour uploader des médias. Vous apprendrez à interagir avec un code back-end et à communiquer avec une API. Vous utiliserez Figma pour les maquettes, Visual Studio Code pour le développement, et GitHub pour la gestion de version."
    },
    {
        "id": "4",
        "title": "Kasa",
        "cover": "/src/assets/Kasa.png",
        "link": "https://quentin1522.github.io/Projet-8-Kasa/",
        "description": "Dans ce projet, vous allez implémenter le front-end d’une application en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive. Vous travaillerez sur la logique de présentation des données et les composants React, une bibliothèque JavaScript populaire pour la création d'interfaces utilisateur. Vous utiliserez React Router pour configurer la navigation entre les différentes pages de l'application, vous permettant de comprendre comment gérer efficacement le routage dans une application web moderne. Le projet se concentrera exclusivement sur le développement front-end, en se basant sur les maquettes fournies et en utilisant des données simulées extraites d'un fichier JSON. Vous commencerez avec Create React App pour simplifier la configuration initiale et utiliserez Node.js pour exécuter du code JavaScript en dehors du navigateur."
    },
    {
        "id": "5",
        "title": "Nina Carducci",
        "cover": "/src/assets/nina.png",
        "link": "https://github.com/Quentin1522/Projet-9-Nina-Carducci/",
        "pictures":[
            "/src/assets/nina.png",
            "/src/assets/nina2.png",
            "/src/assets/nina3.png",
            "/src/assets/nina4.png"
        ],
        "description": "Dans ce projet, vous travaillerez en tant que développeur freelance pour optimiser le référencement d’un site, en améliorant sa performance et son accessibilité. Vous commencerez par identifier les problèmes de chargement et de référencement. Ensuite, vous proposerez des recommandations pour améliorer la vitesse de chargement, la structure du code et le référencement. Vous appliquerez ces améliorations en modifiant le code du site, visant à améliorer les performances et l'accessibilité pour un meilleur référencement sur les moteurs de recherche. Vous utiliserez des outils tels que Lighthouse et Wave pour effectuer des audits. Enfin, vous créerez un rapport illustrant les résultats avant et après les modifications, incluant des captures d'écran des audits et des explications sur les changements apportés et leur impact sur le référencement et l'accessibilité du site."
    },
    {
        "id": "6",
        "title": "Debug une application React",
        "cover": "/src/assets/events.png",
        "link": "https://github.com/Quentin1522/Projet-10-Debug-une-application-React",
        "pictures":[
            "/src/assets/events.png",
            "/src/assets/events2.png",
            "/src/assets/events3.png",
            "/src/assets/events4.png"
        ],
            "description": "Dans ce projet, vous allez débugger et finaliser le développement d'un site one-page. Vous commencerez par examiner le code existant en utilisant les Chrome DevTools pour identifier et comprendre les problèmes et bugs signalés. Vous résoudrez ensuite ces problèmes en utilisant vos compétences en JavaScript et des outils spécifiques à React, comme React Developer Tools. Vous devrez également compléter le cahier de recette, qui détaillera les scénarios de test pour vérifier le bon fonctionnement du site, incluant des tests unitaires et fonctionnels. Vous utiliserez Yarn pour la gestion des packages et Node.js pour exécuter du code JavaScript côté serveur. Votre travail sera versionné avec GitHub, et vous utiliserez Visual Studio Code pour le développement et le débogage du site."
          },
    {
        "id": "7",
        "title": "Argent Bank",
        "cover": "/src/assets/argentBank.png",
        "link": "https://github.com/Quentin1522/Projet-11-ArgentBank",
        "pictures":[
            "/src/assets/argentBank.png",
            "/src/assets/argentBank2.png",
            "/src/assets/argentBank3.png",
            "/src/assets/argentBank4.png"
        ],
            "description": "Dans ce projet, vous travaillerez sur le développement front-end d’une application bancaire en utilisant React et Redux pour créer une expérience utilisateur dynamique et réactive. Vous intégrerez le front-end avec le back-end via des appels API REST, assurant une communication fluide entre le client et le serveur. React sera utilisé pour développer une interface utilisateur complète et responsive, tandis que Redux permettra de gérer l'état global de l'application. Vous utiliserez Swagger pour définir les points d'accès de l'API et modéliser les interactions avec les données des transactions. Node.js sera utilisé pour exécuter du code JavaScript côté serveur, offrant une expérience pratique de la gestion d'une application full-stack."
    },

    {
        "id": "8",
        "title": "Premier Portfolio",
        "cover": "/src/assets/FirstPortofolio.png",
        "link": "https://quentin1522.github.io/Portfolio/",
            "description": "Premier portfolio réalisé dans le cadre d'un projet d'étude."
    }
]
